{
  "about-me": "I am a software engineer passionate about building scalable, real-time systems across startups, government, and big tech. I thrive in fast-paced environments and enjoy using creativity to design unique solutions. I have experience in payment systems, real-time data processing, and fine-tuning large language models. I am excited to contribute my expertise to startups in New York.",

  "about-me-2": "Enjoys Tennis, Basketball, Golf, Hiking and Pokemon Showdown. Has 2 other brothers and a Big Swiss Shepherd named Simba.",

  "education-nus": "Bachelor of Science in Computer Science at the National University of Singapore, starting in August 2023. I represented my residential hall in tennis, track, and frisbee.",

  "education-acsi": "International Bacculaureate student at Anglo Chinese School Independent. I represented the school for long and triple jump.",

  "internship-experience-tiktok-summary": "Backend Software Engineer for User Growth (Paid Ads) at TikTok in Singapore starting June 2025 until the end of October 2025",

  "internship-experience-tiktok-1": "Resolved inefficiencies in financial flows by creating an approval process for payments involving more than thirty branches of conditional logic.",

  "internship-experience-tiktok-2": "Designed and implemented a custom mapping algorithm to display approval progress in the UI.",

  "internship-experience-tiktok-3": "Improved system performance by implementing a batch upload file system with deduplication and error checking validation.",

  "internship-experience-tiktok-4": "Built a system capable of handling over 1000 entries at a time, supported by an asynchronous cron job for seamless user experience.",

  "internship-experience-tiktok-5": "Reduced manual data input and saved approximately 4.5 man-days per month by simplifying the batch upload workflow.",

  "internship-experience-tiktok-6-funny-story": "During my interview for Tiktok, after I finished solving the question, my interviewer asked me to explain it to him in chinese. I somehow managed to cobble together some broken translation and got an offer.",

  "internship-experience-aidf-summary": "Undergraduate Research Intern at the Asian Institute of Digital Finance (AIDF) from January 2025 to May 2025.",

  "internship-experience-aidf-1": "Completed a database migration to Bloomberg financial data for AIDF.",

  "internship-experience-aidf-2": "Used the OpenAI API, fuzzy matching, and pandas to match database variables.",

  "internship-experience-aidf-3": "Wrote Python scripts using pandas to generate over 3000 lines of SQL code for the new database.",

  "internship-experience-aidf-4": "Updated and improved the existing Python backend by rewriting SQL queries, adding multilingual input support, and improving error handling.",

  "internship-experience-aidf-5": "Wrote unit tests using Python's unittest framework for new API calls.",

  "internship-experience-oneberry-summary": "Fullstack Developer at Oneberry Technologies from May 2024 to August 2024.",

  "internship-experience-oneberry-1": "Developed and deployed a real-time live monitoring website with authentication, enabling Singapore's MRT system to track more than 10,000 sensors concurrently.",

  "internship-experience-oneberry-2": "Led backend development using Node.js, Socket.io, RabbitMQ, MQTT, DigitalOcean, Strapi, and PM2 for concurrency.",

  "internship-experience-oneberry-3": "Collaborated on frontend development using Next.js, TypeScript, CSS, Bootstrap, and Chart.js for data visualization.",

  "internship-experience-oneberry-4-funny-story": "The office for Oneberry is situated in Geylang, the redlight district of Singapore. Always a difficult one to explain to people when they asked where I work.",

  "internship-experience-mpa-summary": "Backend Software Engineer at the Maritime Port Authority of Singapore from May 2023 to August 2023.",

  "internship-experience-mpa-1": "Developed and added eight new features to the oneMPA app in collaboration with a frontend engineer.",

  "internship-experience-mpa-2": "Created new databases to handle file and image uploads and related data storage.",

  "internship-experience-mpa-3": "Built RESTful APIs using Node.js, SQL Server, Express.js, and Nodemon.",

  "personal-project-whatsapp-llm-summary": "Whatsapp LLM: A personal project started in 2025 that fine-tunes a large language model to emulate a person's WhatsApp chat patterns using their message history.",

  "personal-project-whatsapp-llm-1": "Fine-tuned a Mistral 7B model using 250,000 WhatsApp messages with a custom training template to emulate personal writing style and knowledge.",

  "personal-project-whatsapp-llm-2": "Used the Unsloth library and QLoRA for efficient parameter tuning.",

  "personal-project-cafe-order-assistant-summary": "An AI-powered barista agent that parses natural language coffee orders into structured decisions, checks inventory, and responds to customers in a friendly way.",

  "personal-project-cafe-order-assistant-1": "A tool based AI agent which utilises the OpenAI api to process natural langange into cafe orders. It is able to handle mutliple orders, charge customers and track",

  "personal-project-cafe-order-assistant-2": "The agent is placed in a state machine and utilises tool calls to transition to/from states and interact with the user.",

  "personal-project-alex-website-summary": "A personal website to showcase my experiences and projects. It utilises the webLLM library to host a client side LLM.",

  "personal-project-alex-website-llm-1": "The chatbot utilises a gemma-2-2b-it-q4f16_1-MLC model alongside with a custom rag pipeline to deliver knowledge about me (alexander).",

  "personal-project-alex-website-llm-2": "The website is built using TypeScript, React, HTML and CSS.",

  "skills-technical": "Technical languages: Go, JavaScript, Python, Java, C, VBA, TypeScript, SQL.",

  "skills-frameworks": "Frameworks and libraries: Node.js, React.js, Pandas, Hertz, Socket.io, Strapi.",

  "skills-tools": "Tools: Git, Docker, MQTT, RabbitMQ, Postman, Thrift, PM2, Cronjob.",

  "skills-languages": "Languages: English and Chinese.",

  "interests": "Interests: Tennis, Basketball, Golf, Hiking, and Pokemon Showdown."
}
